In [195]:
from sqlalchemy import create_engine, text, MetaData, Table
from sqlalchemy.ext.automap import automap_base
from sqlalchemy.orm import sessionmaker, Session
import pandas as pd


# データベースへの接続設定
DATABASE_URI = 'mysql+mysqlconnector://root:password@localhost/lesson'
engine = create_engine(DATABASE_URI)

metadata = MetaData()
metadata.reflect(engine)

# 確認したいテーブル名を指定
table_name = 'books'
table = metadata.tables[table_name]

# テーブルの列情報を表示
print(f"{table_name}テーブルの構造:")
for column in table.columns:
    print(f"列名: {column.name}, データ型: {column.type}")

Base = automap_base()
Base.prepare(engine, reflect=True)

# 'books'テーブルに対応するクラスを取得
Book = Base.classes.books

sessoin = Session(engine)

booksテーブルの構造:
列名: book_id, データ型: CHAR(5)
列名: title, データ型: VARCHAR(100)
列名: cat_id, データ型: CHAR(3)
列名: author, データ型: VARCHAR(50)
列名: date, データ型: DATE
列名: price, データ型: INTEGER
列名: stock, データ型: INTEGER

/var/folders/vp/nnsffs990cb9grbk5s17z9nw0000gn/T/ipykernel_82886/2452229136.py:24: SADeprecationWarning: The AutomapBase.prepare.reflect parameter is deprecated and will be removed in a future release.  Reflection is enabled when AutomapBase.prepare.autoload_with is passed.
  Base.prepare(engine, reflect=True)

In [197]:
# テーブルを確認するための関数
def get_table_data(table_name, engine):
    query = text(f'SELECT * FROM {table_name}')
    with engine.connect() as conn:
        df = pd.read_sql_query(query, conn)
    return df

# CREATE TABLE books

In [7]:
with engine.connect() as connection:
    create_table_query = """
    CREATE TABLE books
    (book_id CHAR(5) PRIMARY KEY,
     title VARCHAR(100) NOT NULL,
     cat_id CHAR(3),
     author VARCHAR(50),
     date DATE,
     price INT,
     stock INT)
    """
    connection.execute(text(create_table_query))
    print("Table created successfully")

Table created successfully

# DESC books;

In [39]:
with engine.connect() as connection:
    desc_table_query = "DESC books"
    result = connection.execute(text(desc_table_query))
    
    # 結果を表示
    df_desc_books = pd.DataFrame(result.fetchall(), columns=result.keys())
df_desc_books

     Field          Type Null  Key Default Extra
0  book_id       char(5)   NO  PRI    None
1    title  varchar(100)   NO         None
2   cat_id       char(3)  YES         None
3   author   varchar(50)  YES         None
4     date          date  YES         None
5    price           int  YES         None
6    stock           int  YES         None

In [26]:
with engine.connect() as conn:
    # トランザクションを明示的に表示する
    trans = conn.begin()
    
    # 例外処理を加える
    try:
        books_insert_query = """
        INSERT INTO books VALUES('B1001', 'たのしく学ぶSQLコマンド', 'C01', '鈴木正男', '2001-05-03', 1800, 120)
        """

        conn.execute(text(books_insert_query))
        trans.commit()
    except Exception as e:
        # エラー発生時のロールバック
        trans.rollback()
        print(f"Error: {e}")

Error: (mysql.connector.errors.IntegrityError) 1062 (23000): Duplicate entry 'B1001' for key 'books.PRIMARY'
[SQL:
        INSERT INTO books VALUES('B1001', 'たのしく学ぶSQLコマンド', 'C01', '鈴木正男', '2001-05-03', 1800, 120)
        ]
(Background on this error at: https://sqlalche.me/e/20/gkpj)

# INSERT INTO books

In [40]:
# データベースに接続してINSERT文を実行
with engine.connect() as conn:
    # トランザクションを開始
    trans = conn.begin()
    try:
        books_insert_query = """
        INSERT INTO books (book_id, title, cat_id, author, date, price, stock) VALUES
        ('B1001', 'たのしく学ぶSQLコマンド', 'C01', '鈴木正男', '2001-05-03', 1800, 120)
        ('B1002', 'はじめてのDB設計', 'C01', '鈴木正子', '2001-10-21', 2000, 88),
        ('B1003', 'ウォーキングをはじめよう', 'C05', '高橋孝子', '2002-09-05', 980, 15),
        ('B1004', 'ネットワーク構築入門', 'C01', '山田和夫', '2004-08-04', 2200, 56),
        ('B1005', '成功する人の108の習慣', 'C02', '高橋太郎', '2008-03-03', 1500, 2),
        ('B1006', 'おてがるレシピ', 'C05', '佐藤茂夫', '2012-04-11', 880, 66),
        ('B1007', 'みきむら先生の基本情報技術教本', 'C03', '三木村健', '2016-08-24', 1800, 32),
        ('B1008', 'Computer Networks', 'C01', 'Robert Smith', '2018-05-05', 2100, 25),
        ('B1009', 'SQL Handbook', 'C01', 'John Doe', '2021-12-01', 2600, 43),
        ('B1010', '風景画を描いてみよう', NULL, '田中十郎', NULL, 1500, NULL);
        """
        conn.execute(text(books_insert_query))
        
        # コミット
        trans.commit()
    except Exception as e:
        # エラー発生時にロールバック
        trans.rollback()
        print(f"Error: {e}")

Error: (mysql.connector.errors.ProgrammingError) 1064 (42000): You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near '('B1002', 'はじめてのDB設計', 'C01', '鈴木正子', '2001-10-21', 2000, ' at line 3
[SQL:
        INSERT INTO books (book_id, title, cat_id, author, date, price, stock) VALUES
        ('B1001', 'たのしく学ぶSQLコマンド', 'C01', '鈴木正男', '2001-05-03', 1800, 120)
        ('B1002', 'はじめてのDB設計', 'C01', '鈴木正子', '2001-10-21', 2000, 88),
        ('B1003', 'ウォーキングをはじめよう', 'C05', '高橋孝子', '2002-09-05', 980, 15),
        ('B1004', 'ネットワーク構築入門', 'C01', '山田和夫', '2004-08-04', 2200, 56),
        ('B1005', '成功する人の108の習慣', 'C02', '高橋太郎', '2008-03-03', 1500, 2),
        ('B1006', 'おてがるレシピ', 'C05', '佐藤茂夫', '2012-04-11', 880, 66),
        ('B1007', 'みきむら先生の基本情報技術教本', 'C03', '三木村健', '2016-08-24', 1800, 32),
        ('B1008', 'Computer Networks', 'C01', 'Robert Smith', '2018-05-05', 2100, 25),
        ('B1009', 'SQL Handbook', 'C01', 'John Doe', '2021-12-01', 2600, 43),
        ('B1010', '風景画を描いてみよう', NULL, '田中十郎', NULL, 1500, NULL);
        ]
(Background on this error at: https://sqlalche.me/e/20/f405)

# booksテーブルの確認

In [41]:
with engine.connect() as conn:
    books_select_query = """
    SELECT * FROM books
    """
    result = conn.execute(text(books_select_query))
    df_books_select = pd.DataFrame(result.fetchall(), columns=result.keys())

df_books_select

  book_id              title cat_id        author        date  price  stock
0   B1001      たのしく学ぶSQLコマンド    C01          鈴木正男  2001-05-03   1800  120.0
1   B1002          はじめてのDB設計    C01          鈴木正子  2001-10-21   2000   88.0
2   B1003       ウォーキングをはじめよう    C05          高橋孝子  2002-09-05    980   15.0
3   B1004         ネットワーク構築入門    C01          山田和夫  2004-08-04   2200   56.0
4   B1005       成功する人の108の習慣    C02          高橋太郎  2008-03-03   1500    2.0
5   B1006            おてがるレシピ    C05          佐藤茂夫  2012-04-11    880   66.0
6   B1007    みきむら先生の基本情報技術教本    C03          三木村健  2016-08-24   1800   32.0
7   B1008  Computer Networks    C01  Robert Smith  2018-05-05   2100   25.0
8   B1009       SQL Handbook    C01      John Doe  2021-12-01   2600   43.0
9   B1010         風景画を描いてみよう   None          田中十郎        None   1500    NaN

# CREATE TABLE category

In [35]:
with engine.connect() as connection:
    create_table_query = """
    CREATE TABLE category
    (cat_id CHAR(5) PRIMARY KEY,
     cat_name VARCHAR(30) NOT NULL
    )
    """
    connection.execute(text(create_table_query))
    print("Table created successfully")

Table created successfully

# DESC category;

In [37]:
with engine.connect() as connection:
    desc_table_query = "DESC category"
    result = connection.execute(text(desc_table_query))
    print(f"resultの方は{type(result)}です。")
    # 結果を表示
    df_desc_cat = pd.DataFrame(result.fetchall(), columns=result.keys())
df_desc_cat

resultの方は<class 'sqlalchemy.engine.cursor.CursorResult'>です。

      Field         Type Null  Key Default Extra
0    cat_id      char(5)   NO  PRI    None
1  cat_name  varchar(30)   NO         None

# INSERT INTO category

In [43]:
# データベースに接続してINSERT文を実行
with engine.connect() as conn:
    # トランザクションを開始
    trans = conn.begin()
    try:
        category_insert_query = """
        INSERT INTO category VALUES
        ('C01', 'コンピューター・IT'),
        ('C02', 'ビジネス'),
        ('C03', '就職・資格'),
        ('C04', '文芸'),
        ('C05', '暮らし・健康')
        """
        conn.execute(text(category_insert_query))
        
        # コミット
        trans.commit()
    except Exception as e:
        # エラー発生時にロールバック
        trans.rollback()
        print(f"Error: {e}")

# categoryの確認

In [47]:
with engine.connect() as conn:
    books_select_query = """
    SELECT * FROM category;
    """
    result = conn.execute(text(books_select_query))
    df_cat_select = pd.DataFrame(result.fetchall(), columns=result.keys())

df_cat_select

  cat_id    cat_name
0    C01  コンピューター・IT
1    C02        ビジネス
2    C03       就職・資格
3    C04          文芸
4    C05      暮らし・健康

# CREATE TABLE books2

In [45]:
with engine.connect() as connection:
    create_table_query = """
    CREATE TABLE books2
    (book_id CHAR(5) PRIMARY KEY,
     title VARCHAR(100) NOT NULL,
     cat_id CHAR(3),
     author VARCHAR(50),
     date DATE,
     price INT,
     stock INT)
    """
    connection.execute(text(create_table_query))
    print("Table created successfully")

Table created successfully

# INSERT INTO books2

In [52]:
# データベースに接続してINSERT文を実行
with engine.connect() as conn:
    # トランザクションを開始
    trans = conn.begin()
    try:
        books2_insert_query = """
        INSERT INTO books2 (book_id, title, cat_id, author, date, price, stock) VALUES
        ('B1101', 'いちか日記', 'C04', '一条いちか', '2012-07-08', 1400, 50),
        ('B1102', 'ココアを飲みながら', 'C04', '二ノ瀬秀治', '2016-09-15', 1600, 66),
        ('B1103', '冬の嘘とリップクリーム', 'C04', '三ツ谷光雄', '2021-03-03', 1200, 120)
        """
        conn.execute(text(books2_insert_query))
        
        # コミット
        trans.commit()
    except Exception as e:
        # エラー発生時にロールバック
        trans.rollback()
        print(f"Error: {e}")

# books2の確認

In [53]:
with engine.connect() as conn:
    books_select_query = """
    SELECT * FROM books2;
    """
    result = conn.execute(text(books_select_query))
    df_books2_select = pd.DataFrame(result.fetchall(), columns=result.keys())

df_books2_select

  book_id        title cat_id author        date  price  stock
0   B1101        いちか日記    C04  一条いちか  2012-07-08   1400     50
1   B1102    ココアを飲みながら    C04  二ノ瀬秀治  2016-09-15   1600     66
2   B1103  冬の嘘とリップクリーム    C04  三ツ谷光雄  2021-03-03   1200    120

In [57]:
with engine.connect() as conn:
    query = """
    SELECT * FROM books;
    """
    result = conn.execute(text(query))
    _df = pd.DataFrame(result.fetchall(), columns=result.keys())

_df

  book_id              title cat_id        author        date  price  stock
0   B1001      たのしく学ぶSQLコマンド    C01          鈴木正男  2001-05-03   1800  120.0
1   B1002          はじめてのDB設計    C01          鈴木正子  2001-10-21   2000   88.0
2   B1003       ウォーキングをはじめよう    C05          高橋孝子  2002-09-05    980   15.0
3   B1004         ネットワーク構築入門    C01          山田和夫  2004-08-04   2200   56.0
4   B1005       成功する人の108の習慣    C02          高橋太郎  2008-03-03   1500    2.0
5   B1006            おてがるレシピ    C05          佐藤茂夫  2012-04-11    880   66.0
6   B1007    みきむら先生の基本情報技術教本    C03          三木村健  2016-08-24   1800   32.0
7   B1008  Computer Networks    C01  Robert Smith  2018-05-05   2100   25.0
8   B1009       SQL Handbook    C01      John Doe  2021-12-01   2600   43.0
9   B1010         風景画を描いてみよう   None          田中十郎        None   1500    NaN

In [58]:
with engine.connect() as conn:
    query = """
    SELECT title, author FROM books;
    """
    result = conn.execute(text(query))
    _df = pd.DataFrame(result.fetchall(), columns=result.keys())

_df

               title        author
0      たのしく学ぶSQLコマンド          鈴木正男
1          はじめてのDB設計          鈴木正子
2       ウォーキングをはじめよう          高橋孝子
3         ネットワーク構築入門          山田和夫
4       成功する人の108の習慣          高橋太郎
5            おてがるレシピ          佐藤茂夫
6    みきむら先生の基本情報技術教本          三木村健
7  Computer Networks  Robert Smith
8       SQL Handbook      John Doe
9         風景画を描いてみよう          田中十郎

In [59]:
with engine.connect() as conn:
    query = """
    SELECT * FROM books
    WHERE price = 1800;
    """
    result = conn.execute(text(query))
    _df = pd.DataFrame(result.fetchall(), columns=result.keys())

_df

  book_id            title cat_id author        date  price  stock
0   B1001    たのしく学ぶSQLコマンド    C01   鈴木正男  2001-05-03   1800    120
1   B1007  みきむら先生の基本情報技術教本    C03   三木村健  2016-08-24   1800     32

In [62]:
with engine.connect() as conn:
    query = """
    SELECT cat_id FROM category
    WHERE cat_name = 'ビジネス';
    """
    result = conn.execute(text(query))
    _df = pd.DataFrame(result.fetchall(), columns=result.keys())

_df

  cat_id
0    C02

In [64]:
with engine.connect() as conn:
    query = """
    SELECT title, date, author FROM books
    WHERE date >= '2010-01-01';
    """
    result = conn.execute(text(query))
    _df = pd.DataFrame(result.fetchall(), columns=result.keys())

_df

               title        date        author
0            おてがるレシピ  2012-04-11          佐藤茂夫
1    みきむら先生の基本情報技術教本  2016-08-24          三木村健
2  Computer Networks  2018-05-05  Robert Smith
3       SQL Handbook  2021-12-01      John Doe

In [65]:
with engine.connect() as conn:
    query = """
    SELECT title, cat_id FROM books
    WHERE cat_id != 'C01';
    """
    result = conn.execute(text(query))
    _df = pd.DataFrame(result.fetchall(), columns=result.keys())

_df

             title cat_id
0     ウォーキングをはじめよう    C05
1     成功する人の108の習慣    C02
2          おてがるレシピ    C05
3  みきむら先生の基本情報技術教本    C03

In [66]:
with engine.connect() as conn:
    query = """
    SELECT title, cat_id FROM books
    WHERE cat_id != 'C01';
    """
    _df = pd.read_sql(text(query), engine)

_df

             title cat_id
0     ウォーキングをはじめよう    C05
1     成功する人の108の習慣    C02
2          おてがるレシピ    C05
3  みきむら先生の基本情報技術教本    C03

In [69]:
with engine.connect() as conn:
    query = '''
    SELECT * FROM books WHERE cat_id IS NULL
    '''

    result = conn.execute(text(query))
    _df = pd.DataFrame(result.fetchall(), columns=result.keys())
_df

  book_id       title cat_id author  date  price stock
0   B1010  風景画を描いてみよう   None   田中十郎  None   1500  None

In [70]:
with engine.connect() as conn:
    query = '''
    SELECT * FROM books WHERE cat_id IS NOT NULL
    '''

    result = conn.execute(text(query))
    _df = pd.DataFrame(result.fetchall(), columns=result.keys())
_df

  book_id              title cat_id        author        date  price  stock
0   B1001      たのしく学ぶSQLコマンド    C01          鈴木正男  2001-05-03   1800    120
1   B1002          はじめてのDB設計    C01          鈴木正子  2001-10-21   2000     88
2   B1003       ウォーキングをはじめよう    C05          高橋孝子  2002-09-05    980     15
3   B1004         ネットワーク構築入門    C01          山田和夫  2004-08-04   2200     56
4   B1005       成功する人の108の習慣    C02          高橋太郎  2008-03-03   1500      2
5   B1006            おてがるレシピ    C05          佐藤茂夫  2012-04-11    880     66
6   B1007    みきむら先生の基本情報技術教本    C03          三木村健  2016-08-24   1800     32
7   B1008  Computer Networks    C01  Robert Smith  2018-05-05   2100     25
8   B1009       SQL Handbook    C01      John Doe  2021-12-01   2600     43

In [72]:
with engine.connect() as conn:
    query = '''
    SELECT book_id, title, price, stock FROM books WHERE price >= 1500 AND stock >= 50
    '''

    result = conn.execute(text(query))
    _df = pd.DataFrame(result.fetchall(), columns=result.keys())
_df

  book_id          title  price  stock
0   B1001  たのしく学ぶSQLコマンド   1800    120
1   B1002      はじめてのDB設計   2000     88
2   B1004     ネットワーク構築入門   2200     56

In [73]:
with engine.connect() as conn:
    query = '''
    SELECT book_id, title, price, stock FROM books WHERE price >= 1500 OR stock >= 50
    '''

    result = conn.execute(text(query))
    _df = pd.DataFrame(result.fetchall(), columns=result.keys())
_df

  book_id              title  price  stock
0   B1001      たのしく学ぶSQLコマンド   1800  120.0
1   B1002          はじめてのDB設計   2000   88.0
2   B1004         ネットワーク構築入門   2200   56.0
3   B1005       成功する人の108の習慣   1500    2.0
4   B1006            おてがるレシピ    880   66.0
5   B1007    みきむら先生の基本情報技術教本   1800   32.0
6   B1008  Computer Networks   2100   25.0
7   B1009       SQL Handbook   2600   43.0
8   B1010         風景画を描いてみよう   1500    NaN

# 評価の優先順位について
- 評価の優先順位はNOT→AND→ORの順になります。
- 優先順位を変更する場合は、優先する条件をカッコで囲みます。

In [74]:
with engine.connect() as conn:
    query = '''
    SELECT book_id, cat_id, title, price FROM books
    WHERE cat_id = 'C02' OR cat_id = 'C03' AND price >= 1600
    '''
    result = conn.execute(text(query))
    _df = pd.DataFrame(result.fetchall(), columns=result.keys())
_df

  book_id cat_id            title  price
0   B1005    C02     成功する人の108の習慣   1500
1   B1007    C03  みきむら先生の基本情報技術教本   1800

In [75]:
with engine.connect() as conn:
    query = '''
    SELECT book_id, cat_id, title, price FROM books
    WHERE cat_id = 'C02'
    '''
    result = conn.execute(text(query))
    _df = pd.DataFrame(result.fetchall(), columns=result.keys())
_df

  book_id cat_id         title  price
0   B1005    C02  成功する人の108の習慣   1500

In [77]:
with engine.connect() as conn:
    query = '''
    SELECT book_id, cat_id, title, price FROM books
    WHERE (cat_id = 'C02' OR cat_id = 'C03') AND price >= 1600
    '''
    result = conn.execute(text(query))
    _df = pd.DataFrame(result.fetchall(), columns=result.keys())
_df

  book_id cat_id            title  price
0   B1007    C03  みきむら先生の基本情報技術教本   1800

In [80]:
with engine.connect() as conn:
    query = """
    SELECT book_id, title FROM books
    ;
    """
    result = conn.execute(text(query))
    _df = pd.DataFrame(result.fetchall(), columns=result.keys())
_df

  book_id              title
0   B1001      たのしく学ぶSQLコマンド
1   B1002          はじめてのDB設計
2   B1003       ウォーキングをはじめよう
3   B1004         ネットワーク構築入門
4   B1005       成功する人の108の習慣
5   B1006            おてがるレシピ
6   B1007    みきむら先生の基本情報技術教本
7   B1008  Computer Networks
8   B1009       SQL Handbook
9   B1010         風景画を描いてみよう

In [83]:
with engine.connect() as conn:
    q = '''
    SELECT title, price FROM books 
    WHERE price BETWEEN 1500 AND 2000
    '''
    result = conn.execute(text(q))
    df = pd.DataFrame(result.fetchall(), columns=result.keys())
df

             title  price
0    たのしく学ぶSQLコマンド   1800
1        はじめてのDB設計   2000
2     成功する人の108の習慣   1500
3  みきむら先生の基本情報技術教本   1800
4       風景画を描いてみよう   1500

# 2-8

In [84]:
with engine.connect() as conn:
    q = '''
    SELECT title, price FROM books
    WHERE price >=1500 AND price <= 2000'''
    df = pd.read_sql(text(q),con=engine)
df

             title  price
0    たのしく学ぶSQLコマンド   1800
1        はじめてのDB設計   2000
2     成功する人の108の習慣   1500
3  みきむら先生の基本情報技術教本   1800
4       風景画を描いてみよう   1500

# サンプル社員テーブルの作成

In [89]:
# 社員テーブルの作成、IF NOT EXISTSでテーブルが存在しない場合のみ作成
create_table_query = '''
CREATE TABLE IF NOT EXISTS employee (
    employee_id INT PRIMARY KEY,
    employee_name VARCHAR(50),
    gender CHAR(1),
    birth_date DATE
) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci
'''

with engine.begin() as connection:
    connection.execute(text(create_table_query))

# サンプルデータの挿入、タプルは明示的に記述した方がわかりやすい
insert_data_query = '''
INSERT INTO employee (employee_id, employee_name, gender, birth_date) VALUES
(1, '山田太郎', 'M', '1980-05-01'),
(2, '佐藤花子', 'F', '1985-09-15'),
(3, '鈴木一郎', 'M', '1990-03-20'),
(4, '田中美穂', 'F', '1982-11-30'),
(5, '高橋健太', 'M', '1988-07-07')
'''

with engine.begin() as connection:
    connection.execute(text(insert_data_query))

In [90]:
query = '''
    SELECT * FROM employee
    '''
with engine.connect() as conn:
    df = pd.read_sql_query(text(query),con=engine)
df

   employee_id employee_name gender  birth_date
0            1          山田太郎      M  1980-05-01
1            2          佐藤花子      F  1985-09-15
2            3          鈴木一郎      M  1990-03-20
3            4          田中美穂      F  1982-11-30
4            5          高橋健太      M  1988-07-07

In [94]:
# 問題のSQLクエリを実行（正解はウ）
query = '''
SELECT employee_id, employee_name, gender FROM employee AS E1
WHERE birth_date > (
    SELECT MIN(birth_date) FROM employee AS E2
    WHERE E1.gender = E2.gender
)
'''

with engine.connect() as connection:
    result = connection.execute(text(query))
    df = pd.DataFrame(result.fetchall(), columns=result.keys())

print(df)

   employee_id employee_name gender
0            2          佐藤花子      F
1            3          鈴木一郎      M
2            5          高橋健太      M

In [95]:
# SQLコマンドを実行する関数（トランザクション処理を含む）
def execute_sql(sql):
    with engine.begin() as connection:
        connection.execute(text(sql))

# テーブル作成と外部キー設定
sql_commands = [
    """
    CREATE TABLE IF NOT EXISTS departments (
        department_code CHAR(3) PRIMARY KEY,
        department_name VARCHAR(100) NOT NULL
    );
    """,
    """
    CREATE TABLE IF NOT EXISTS doctors (
        doctor_id INT PRIMARY KEY,
        doctor_name VARCHAR(100) NOT NULL,
        department_code CHAR(3) NOT NULL,
        FOREIGN KEY (department_code) REFERENCES departments(department_code)
        ON DELETE RESTRICT
        ON UPDATE CASCADE
    );
    """,
    """
    CREATE TABLE IF NOT EXISTS patients (
        patient_id INT PRIMARY KEY,
        patient_name VARCHAR(100) NOT NULL
    );
    """,
    """
    CREATE TABLE IF NOT EXISTS examinations (
        examination_id INT PRIMARY KEY AUTO_INCREMENT,
        department_code CHAR(3) NOT NULL,
        patient_id INT NOT NULL,
        examination_datetime DATETIME NOT NULL,
        FOREIGN KEY (department_code) REFERENCES departments(department_code)
        ON DELETE RESTRICT
        ON UPDATE CASCADE,
        FOREIGN KEY (patient_id) REFERENCES patients(patient_id)
        ON DELETE RESTRICT
        ON UPDATE CASCADE
    );
    """
]

# SQLコマンドの実行
for command in sql_commands:
    execute_sql(command)

# サンプルデータの挿入
insert_data = [
    "INSERT INTO departments (department_code, department_name) VALUES ('001', 'Internal Medicine'), ('002', 'Surgery'), ('003', 'Pediatrics');",
    "INSERT INTO doctors (doctor_id, doctor_name, department_code) VALUES (1, 'Ichiro Sato', '001'), (2, 'Hanako Suzuki', '002'), (3, 'Taro Tanaka', '003');",
    "INSERT INTO patients (patient_id, patient_name) VALUES (101, 'Jiro Yamada'), (102, 'Michiko Nakamura'), (103, 'Kenta Kobayashi');",
    "INSERT INTO examinations (department_code, patient_id, examination_datetime) VALUES ('001', 101, '2023-08-11 09:00:00'), ('002', 102, '2023-08-11 10:30:00'), ('003', 103, '2023-08-11 14:15:00');"
]

for insert in insert_data:
    execute_sql(insert)

print("Tables created and data inserted successfully.")

Tables created and data inserted successfully.

- テーブルの中身を確認する。

In [99]:
# クエリのリスト
queries = [
    'SELECT * FROM departments',
    'SELECT * FROM doctors',
    'SELECT * FROM patients',
    'SELECT * FROM examinations'
]

# データフレームを格納するディクショナリ
dfs = {}

# 各クエリを実行してデータフレームを作成
for query in queries:
    with engine.connect() as conn:
        df = pd.read_sql_query(text(query), conn)
        table_name = query.split()[-1]  # テーブル名を抽出
        dfs[table_name] = df

# 作成されたデータフレームを確認
for table_name, df in dfs.items():
    print(f"\n{table_name} DataFrame:")
    print(df.head())
    print(f"Shape: {df.shape}")

departments DataFrame:
  department_code    department_name
0             001  Internal Medicine
1             002            Surgery
2             003         Pediatrics
Shape: (3, 2)

doctors DataFrame:
   doctor_id    doctor_name department_code
0          1    Ichiro Sato             001
1          2  Hanako Suzuki             002
2          3    Taro Tanaka             003
Shape: (3, 3)

patients DataFrame:
   patient_id      patient_name
0         101       Jiro Yamada
1         102  Michiko Nakamura
2         103   Kenta Kobayashi
Shape: (3, 2)

examinations DataFrame:
   examination_id department_code  patient_id examination_datetime
0               1             001         101  2023-08-11 09:00:00
1               2             002         102  2023-08-11 10:30:00
2               3             003         103  2023-08-11 14:15:00
Shape: (3, 4)

# <参考2> 単一行副問い合わせ

In [105]:
with engine.connect() as conn:
    query = 'show tables;'
    df = pd.read_sql_query(text(query), conn)
df

  Tables_in_lesson
0            books
1           books2
2         category
3      departments
4          doctors
5         employee
6     examinations
7         patients

In [111]:
with engine.connect() as conn:
    query = '''
    SELECT * FROM category WHERE cat_name = 'ビジネス'
    '''
    df = pd.read_sql_query(text(query), conn)
df

  cat_id cat_name
0    C02     ビジネス

In [113]:
with engine.connect() as conn:
    # WHEREでcat_idを一致させたいから単一副問い合わせでフィルタリング
    query = '''
    SELECT cat_id, title FROM books
    WHERE cat_id = (SELECT cat_id FROM category WHERE cat_name = 'ビジネス')'''
    df = pd.read_sql_query(text(query), conn)
df

  cat_id         title
0    C02  成功する人の108の習慣

# <参考3> 複数行副問い合わせ

In [115]:
with engine.connect() as conn:
    query = '''
    SELECT * FROM books'''
    df = pd.read_sql_query(text(query), conn)
df

  book_id              title cat_id        author        date  price  stock
0   B1001      たのしく学ぶSQLコマンド    C01          鈴木正男  2001-05-03   1800  120.0
1   B1002          はじめてのDB設計    C01          鈴木正子  2001-10-21   2000   88.0
2   B1003       ウォーキングをはじめよう    C05          高橋孝子  2002-09-05    980   15.0
3   B1004         ネットワーク構築入門    C01          山田和夫  2004-08-04   2200   56.0
4   B1005       成功する人の108の習慣    C02          高橋太郎  2008-03-03   1500    2.0
5   B1006            おてがるレシピ    C05          佐藤茂夫  2012-04-11    880   66.0
6   B1007    みきむら先生の基本情報技術教本    C03          三木村健  2016-08-24   1800   32.0
7   B1008  Computer Networks    C01  Robert Smith  2018-05-05   2100   25.0
8   B1009       SQL Handbook    C01      John Doe  2021-12-01   2600   43.0
9   B1010         風景画を描いてみよう   None          田中十郎        None   1500    NaN

In [116]:
with engine.connect() as conn:
    query = '''
    SELECT cat_id, cat_name FROM category
    WHERE cat_id IN (SELECT cat_id FROM books WHERE book_id >= 'B1001' AND book_id <= 'B1005')'''
    df = pd.read_sql_query(text(query), conn)

df

  cat_id    cat_name
0    C01  コンピューター・IT
1    C02        ビジネス
2    C05      暮らし・健康

In [119]:
query = '''
    SELECT cat_id, cat_name FROM category
    WHERE EXISTS (SELECT * FROM books WHERE books.cat_id = category.cat_id)'''
with engine.connect() as conn:
    df = pd.read_sql_query(text(query), conn)
df

  cat_id    cat_name
0    C01  コンピューター・IT
1    C02        ビジネス
2    C03       就職・資格
3    C05      暮らし・健康

はい、その通りです。SQLとPythonの学習プロセスの違いについて、とても良い観察をされていますね。それぞれの特徴と学習アプローチについて、もう少し詳しく見ていきましょう。



1. SQLの特徴：
   - 標準化： ANSI SQLという標準があり、多くのデータベースシステムがこれに準拠しています。
   - 限定的な機能セット： データの操作と取得に特化した言語であるため、基本的な構文は比較的少ないです。
   - データベース間の違い： OracleやPostgreSQL、MySQLなどで多少の違いはありますが、基本的な操作はほぼ共通しています。

2. Pythonの特徴：
   - 汎用プログラミング言語： データ処理、ウェブ開発、機械学習など、幅広い用途に使用されます。
   - 豊富なライブラリ： 様々な機能を提供する多数のライブラリが存在します。
   - 頻繁な更新： 言語自体やライブラリが頻繁に更新され、新しい機能が追加されます。

学習アプローチの違い：

1. SQLの学習：
   - 基本構文の習得： SELECT, INSERT, UPDATE, DELETEなどの基本的な操作を学ぶことで、多くのタスクをこなせるようになります。
   - データモデリング： テーブル設計やリレーションシップの理解が重要です。
   - 最適化： クエリのパフォーマンス改善のための学習が必要です。

2. Pythonの学習：
   - 基本構文の習得： 変数、制御構造、関数などの基本を学びます。
   - オブジェクト指向プログラミング： クラスや継承などの概念を理解する必要があります。
   - ライブラリの活用： 目的に応じて適切なライブラリを選び、そのドキュメントを読んで使い方を学ぶ必要があります。
   - ベストプラクティス： コーディング規約やデザインパターンなどを学ぶことが重要です。

SQLとPythonの学習コストの比較：

1. 初期学習コスト：
   - SQL： 比較的低い。基本的なCRUD操作を学ぶだけで、多くのタスクをこなせるようになります。
   - Python： やや高い。基本構文に加えて、オブジェクト指向の概念やライブラリの使用方法を学ぶ必要があります。

2. 応用学習コスト：
   - SQL： 中程度。複雑なクエリの作成や最適化、特定のデータベース固有の機能を学ぶ必要があります。
   - Python： 高い。目的に応じて様々なライブラリや応用技術を学び続ける必要があります。

3. 継続的な学習：
   - SQL： 比較的少ない。基本的な構文は長期間変わらないため、一度習得すれば長く使えます。
   - Python： 多い。新しいライブラリや言語機能が頻繁に登場するため、継続的な学習が必要です。

結論として、SQLは特定の目的（データ操作）に特化しているため、初期の学習コストは低く、習得も比較的容易です。一方、Pythonはより汎用的で幅広い用途に使用できますが、それゆえに学ぶべき内容も多くなります。

しかし、両方の言語を学ぶことで、データ処理やアプリケーション開発において強力なスキルセットを獲得できます。SQLでデータを効率的に操作し、Pythonでそのデータを処理したり、アプリケーションを構築したりすることができるようになります。

In [122]:
# テーブル作成とサンプルデータ挿入
with engine.begin() as conn:
    conn.execute(text("""
    CREATE TABLE IF NOT EXISTS candy_store_inventory (
        id INT AUTO_INCREMENT PRIMARY KEY,
        item_name VARCHAR(50) NOT NULL,
        quantity INT NOT NULL
    )
    """))

    conn.execute(text("""
    CREATE TABLE IF NOT EXISTS candy_store_transaction_log (
        id INT AUTO_INCREMENT PRIMARY KEY,
        item_name VARCHAR(50) NOT NULL,
        before_quantity INT NOT NULL,
        after_quantity INT NOT NULL,
        update_time DATETIME DEFAULT CURRENT_TIMESTAMP
    )
    """))

    # サンプルデータの挿入
    sample_data = [
        ("チョコレート", 100),
        ("キャンディ", 150),
        ("クッキー", 80),
        ("ガム", 200),
        ("ゼリー", 120)
    ]

    for item, quantity in sample_data:
        conn.execute(text("""
        INSERT INTO candy_store_inventory (item_name, quantity)
        VALUES (:item_name, :quantity)
        ON DUPLICATE KEY UPDATE quantity = :quantity
        """), {"item_name": item, "quantity": quantity})

    print("サンプルデータを挿入しました。")

# 在庫確認関数
def check_inventory():
    with engine.connect() as conn:
        result = conn.execute(text("SELECT item_name, quantity FROM candy_store_inventory"))
        for row in result:
            print(f"{row.item_name}: {row.quantity}個")

# 在庫更新とログ記録の関数
def update_inventory_and_log(item_name, quantity_change):
    with engine.begin() as conn:
        # 現在の在庫数を取得
        result = conn.execute(text(
            "SELECT quantity FROM candy_store_inventory WHERE item_name = :item_name"
        ), {"item_name": item_name}).fetchone()

        if result:
            before_quantity = result[0]
            after_quantity = before_quantity + quantity_change

            # 在庫が負にならないかチェック
            if after_quantity < 0:
                raise ValueError(f"{item_name}の在庫が不足しています。現在の在庫: {before_quantity}")

            # 在庫を更新
            conn.execute(text(
                "UPDATE candy_store_inventory SET quantity = :after_quantity WHERE item_name = :item_name"
            ), {"after_quantity": after_quantity, "item_name": item_name})

            # ログを記録
            conn.execute(text(
                "INSERT INTO candy_store_transaction_log (item_name, before_quantity, after_quantity) VALUES (:item_name, :before_quantity, :after_quantity)"
            ), {"item_name": item_name, "before_quantity": before_quantity, "after_quantity": after_quantity})

            print(f"{item_name}の在庫を更新しました。前: {before_quantity}, 後: {after_quantity}")
        else:
            print(f"{item_name}は在庫にありません。")

# ロールフォワードの模擬
def rollforward():
    with engine.begin() as conn:
        # 最新のログエントリを取得
        latest_log = conn.execute(text(
            "SELECT item_name, after_quantity FROM candy_store_transaction_log ORDER BY update_time DESC LIMIT 1"
        )).fetchone()

        if latest_log:
            item_name, after_quantity = latest_log

            # 在庫を最新のログ情報で更新
            conn.execute(text(
                "UPDATE candy_store_inventory SET quantity = :after_quantity WHERE item_name = :item_name"
            ), {"after_quantity": after_quantity, "item_name": item_name})

            print(f"ロールフォワード完了: {item_name}の在庫を{after_quantity}に更新しました。")
        else:
            print("ログがありません。")

# 初期在庫確認
print("初期在庫状態:")
check_inventory()

# 使用例
update_inventory_and_log("チョコレート", -5)  # チョコレートを5個減らす
update_inventory_and_log("キャンディ", 10)   # キャンディを10個増やす

# 更新後の在庫確認
print("\n更新後の在庫状態:")
check_inventory()

# ロールフォワードの実行
rollforward()

# ロールフォワード後の在庫確認
print("\nロールフォワード後の在庫状態:")
check_inventory()

サンプルデータを挿入しました。
初期在庫状態:
チョコレート: 100個
キャンディ: 150個
クッキー: 80個
ガム: 200個
ゼリー: 120個
チョコレートの在庫を更新しました。前: 100, 後: 95
キャンディの在庫を更新しました。前: 150, 後: 160

更新後の在庫状態:
チョコレート: 95個
キャンディ: 160個
クッキー: 80個
ガム: 200個
ゼリー: 120個
ロールフォワード完了: チョコレートの在庫を95に更新しました。

ロールフォワード後の在庫状態:
チョコレート: 95個
キャンディ: 160個
クッキー: 80個
ガム: 200個
ゼリー: 120個

あなたの学習アプローチは非常に効果的で実践的です。データベーススペシャリストの過去問題を解き、不正解だった問題をPythonとSQLで実際に動かして理解するという方法は、理論と実践を結びつける素晴らしい方法です。しかし、さらに効果を高めるために、いくつかの改善点や追加のアイデアを提案させていただきます。



1. 体系的なアプローチ:
   - 過去問題を単に順番に解くのではなく、トピックごとにグループ化して学習する。
   - 例: 一週間は「インデックス」、次の週は「トランザクション」というように focus areas を設定する。

2. 実データの使用:
   - 可能であれば、会社の実際のデータ（もしくはそれに近いサンプルデータ）を使用して問題を再現する。
   - これにより、学んだ内容を実務に直接結びつけやすくなります。

3. クエリ最適化の実践:
   - 不正解だった問題のSQLを実行するだけでなく、そのクエリの実行計画を分析する。
   - データベースの EXPLAIN PLAN 機能を使用して、クエリの効率を理解し改善する練習をする。

4. プロジェクトベースの学習:
   - 過去問題から得た知識を使って、小規模なプロジェクトを定期的に行う。
   - 例: データベース設計、データ移行スクリプトの作成、レポーティングシステムの構築など。

5. ペアプログラミングまたは Code Review:
   - 可能であれば、同僚や他の学習者とペアを組んで問題を解く。
   - 解答をオンラインコミュニティで共有し、フィードバックを得る。

6. 学習ジャーナルの作成:
   - 学んだことをブログにまとめるや、個人のノートを作成する。これにより、知識の定着と理解の深化が促進されます。

7. 逆方向のアプローチ:
   - 正解した問題でも、その逆の状況や変則的なケースを考え、SQLで実装してみる。

8. パフォーマンステストの実施:
   - 大量のデータを生成し、クエリの実行時間や Resource Usage を測定する。
   - これにより、スケーラビリティの観点からも理解が深まります。

9. データモデリング演習:
   - 過去問題で出てきた概念を使って、実際のビジネスシナリオに基づいたデータモデルを設計する。

10. 定期的な振り返りと総復習:
    - 月に一度、これまでに学んだ内容を振り返り、弱点を特定して集中的に復習する時間を設ける。

11. 新技術の探索:
    - NoSQLデータベースや最新のデータ処理技術について学び、SQL RDBMSとの比較を行う。

12. 自動化ツールの活用:
    - テストデータ生成やクエリ実行を自動化するPythonスクリプトを作成し、効率的に多くのシナリオをテストする。

これらの改善点を取り入れることで、より包括的で実践的な学習が可能になります。理論的な知識だけでなく、実務で直面する可能性のある問題に対処する能力も向上するでしょう。また、このアプローチは単にデータベーススペシャリスト試験の合格だけでなく、実際の職場でのパフォーマンス向上にも直結します。

定期的に学習方法を見直し、効果を確認しながら、必要に応じて調整を加えていくことをお勧めします。継続的な学習と実践を通じて、データベースとデータ分析のスキルを着実に向上させていけるはずです。

In [123]:
with engine.connect() as conn:
    df = pd.read_sql_query(text('show tables'), conn)
df

              Tables_in_lesson
0                        books
1                       books2
2        candy_store_inventory
3  candy_store_transaction_log
4                     category
5                  departments
6                      doctors
7                     employee
8                 examinations
9                     patients

In [126]:
with engine.connect() as conn:
    df = pd.read_sql_query(text('SELECT * FROM departments'), conn)
df

  department_code    department_name
0             001  Internal Medicine
1             002            Surgery
2             003         Pediatrics

In [128]:
with engine.connect() as conn:
    df = pd.read_sql_query(text('SELECT title, price FROM books WHERE price BETWEEN 1500 AND 2000'), conn)
df

             title  price
0    たのしく学ぶSQLコマンド   1800
1        はじめてのDB設計   2000
2     成功する人の108の習慣   1500
3  みきむら先生の基本情報技術教本   1800
4       風景画を描いてみよう   1500

In [129]:
with engine.connect() as conn:
    q = text('''SELECT title, price FROM books
             WHERE price >= 1500 AND price <=2000''')
    df = pd.read_sql_query(q, conn)
df

             title  price
0    たのしく学ぶSQLコマンド   1800
1        はじめてのDB設計   2000
2     成功する人の108の習慣   1500
3  みきむら先生の基本情報技術教本   1800
4       風景画を描いてみよう   1500

In [130]:
with engine.connect() as conn:
    df = pd.read_sql_query(text('SELECT title, price FROM books WHERE price NOT BETWEEN 1500 AND 2000'), conn)
df

               title  price
0       ウォーキングをはじめよう    980
1         ネットワーク構築入門   2200
2            おてがるレシピ    880
3  Computer Networks   2100
4       SQL Handbook   2600

In [132]:
with engine.connect() as conn:
    q = text('''SELECT title, price FROM books
             WHERE price < 1500 OR price > 2000''')
    df = pd.read_sql_query(q, conn)
df

               title  price
0       ウォーキングをはじめよう    980
1         ネットワーク構築入門   2200
2            おてがるレシピ    880
3  Computer Networks   2100
4       SQL Handbook   2600

# 2-9 リストマッチング

In [133]:
q = text('''SELECT title, cat_id FROM books
         WHERE cat_id IN("C01", "C05");''')
with engine.connect() as conn:
    df = pd.read_sql_query(q,conn)
df

               title cat_id
0      たのしく学ぶSQLコマンド    C01
1          はじめてのDB設計    C01
2       ウォーキングをはじめよう    C05
3         ネットワーク構築入門    C01
4            おてがるレシピ    C05
5  Computer Networks    C01
6       SQL Handbook    C01

In [134]:
q = text('''SELECT title, cat_id FROM books
         WHERE cat_id = "C01" OR cat_id = "C05";
         ''')
with engine.connect() as conn:
    df = pd.read_sql_query(q, conn)
df

               title cat_id
0      たのしく学ぶSQLコマンド    C01
1          はじめてのDB設計    C01
2       ウォーキングをはじめよう    C05
3         ネットワーク構築入門    C01
4            おてがるレシピ    C05
5  Computer Networks    C01
6       SQL Handbook    C01

In [135]:
q = text('''SELECT title, cat_id FROM books
         WHERE cat_id NOT IN("C01", "C05");''')
with engine.connect() as conn:
    df = pd.read_sql_query(q,conn)
df

             title cat_id
0     成功する人の108の習慣    C02
1  みきむら先生の基本情報技術教本    C03

In [136]:
q = text('''SELECT title, cat_id FROM books
         WHERE cat_id != "C01" AND cat_id != "C05";
         ''')
with engine.connect() as conn:
    df = pd.read_sql_query(q, conn)
df

             title cat_id
0     成功する人の108の習慣    C02
1  みきむら先生の基本情報技術教本    C03

# 2-10 パターンマッチング

In [138]:
q = '''SELECT title, author FROM books WHERE title = "おてがるレシピ";'''
with engine.begin() as conn:
    df = pd.read_sql_query(text(q), conn)
df

     title author
0  おてがるレシピ   佐藤茂夫

In [139]:
q = 'show tables;'
with engine.connect() as conn:
    df = pd.read_sql_query(text(q),conn)
df

              Tables_in_lesson
0                        books
1                       books2
2        candy_store_inventory
3  candy_store_transaction_log
4                     category
5                  departments
6                      doctors
7                     employee
8                 examinations
9                     patients

In [140]:
q = 'SELECT * FROM books'
with engine.connect() as conn:
    df = pd.read_sql_query(text(q), conn)
df

  book_id              title cat_id        author        date  price  stock
0   B1001      たのしく学ぶSQLコマンド    C01          鈴木正男  2001-05-03   1800  120.0
1   B1002          はじめてのDB設計    C01          鈴木正子  2001-10-21   2000   88.0
2   B1003       ウォーキングをはじめよう    C05          高橋孝子  2002-09-05    980   15.0
3   B1004         ネットワーク構築入門    C01          山田和夫  2004-08-04   2200   56.0
4   B1005       成功する人の108の習慣    C02          高橋太郎  2008-03-03   1500    2.0
5   B1006            おてがるレシピ    C05          佐藤茂夫  2012-04-11    880   66.0
6   B1007    みきむら先生の基本情報技術教本    C03          三木村健  2016-08-24   1800   32.0
7   B1008  Computer Networks    C01  Robert Smith  2018-05-05   2100   25.0
8   B1009       SQL Handbook    C01      John Doe  2021-12-01   2600   43.0
9   B1010         風景画を描いてみよう   None          田中十郎        None   1500    NaN

In [143]:
with engine.connect() as conn:
    df = pd.read_sql_query(text('SELECT * FROM category;'), conn)
df

  cat_id    cat_name
0    C01  コンピューター・IT
1    C02        ビジネス
2    C03       就職・資格
3    C04          文芸
4    C05      暮らし・健康

In [145]:
with engine.connect() as connection:
    df = pd.read_sql_query(text("""
    SELECT DISTINCT books.cat_id 
    FROM books
    WHERE cat_id IN (SELECT cat_id FROM category)
    """), connection)
df

  cat_id
0    C01
1    C05
2    C02
3    C03

In [146]:
import numpy as np

a = np.array([[0,1,10],[0,1,10]])
b = np.array([[100],[100]])
c = np.concatenate([a,b],axis=1)
print(f"reshape前のc \n{c}")
c = c.reshape(4,2)
print(f"reshape後のc \n{c}")
print(f'結果\n{np.dot(c, b)}')

reshape前のc
[[  0   1  10 100]
 [  0   1  10 100]]
reshape後のc
[[  0   1]
 [ 10 100]
 [  0   1]
 [ 10 100]]
結果
[[  100]
 [11000]
 [  100]
 [11000]]

In [150]:
# 前方一致のクエリ。LIKEは演算子不要
q = "SELECT title FROM books WHERE title LIKE 'SQL%';"
with engine.connect() as conn:
    df = pd.read_sql_query(text(q), conn)
df

          title
0  SQL Handbook

In [151]:
# 後方一致のクエリ。LIKEは演算子不要
q = "SELECT title FROM books WHERE title LIKE '%SQL';"
with engine.connect() as conn:
    df = pd.read_sql_query(text(q), conn)
df

Empty DataFrame
Columns: [title]
Index: []

In [152]:
# 部分一致のクエリ。LIKEは演算子不要
q = "SELECT title FROM books WHERE title LIKE '%SQL%';"
with engine.connect() as conn:
    df = pd.read_sql_query(text(q), conn)
df

           title
0  たのしく学ぶSQLコマンド
1   SQL Handbook

# 2-11 並び替え

In [153]:
q = '''SELECT book_id, title, price FROM books
        ORDER BY price ASC;'''
with engine.connect() as conn:
    df = pd.read_sql_query(text(q), conn)
df

  book_id              title  price
0   B1006            おてがるレシピ    880
1   B1003       ウォーキングをはじめよう    980
2   B1005       成功する人の108の習慣   1500
3   B1010         風景画を描いてみよう   1500
4   B1001      たのしく学ぶSQLコマンド   1800
5   B1007    みきむら先生の基本情報技術教本   1800
6   B1002          はじめてのDB設計   2000
7   B1008  Computer Networks   2100
8   B1004         ネットワーク構築入門   2200
9   B1009       SQL Handbook   2600

In [154]:
# ORDER BYは初期値がASCなので記述不要
q = '''SELECT book_id, title, price FROM books
        ORDER BY price ;'''
with engine.connect() as conn:
    df = pd.read_sql_query(text(q), conn)
df

  book_id              title  price
0   B1006            おてがるレシピ    880
1   B1003       ウォーキングをはじめよう    980
2   B1005       成功する人の108の習慣   1500
3   B1010         風景画を描いてみよう   1500
4   B1001      たのしく学ぶSQLコマンド   1800
5   B1007    みきむら先生の基本情報技術教本   1800
6   B1002          はじめてのDB設計   2000
7   B1008  Computer Networks   2100
8   B1004         ネットワーク構築入門   2200
9   B1009       SQL Handbook   2600

In [155]:
# 列の順番でも記述できる1,2,3..といった形のようだ
q = '''SELECT book_id, title, price FROM books
        ORDER BY 3 ;'''
with engine.connect() as conn:
    df = pd.read_sql_query(text(q), conn)
df

  book_id              title  price
0   B1006            おてがるレシピ    880
1   B1003       ウォーキングをはじめよう    980
2   B1005       成功する人の108の習慣   1500
3   B1010         風景画を描いてみよう   1500
4   B1001      たのしく学ぶSQLコマンド   1800
5   B1007    みきむら先生の基本情報技術教本   1800
6   B1002          はじめてのDB設計   2000
7   B1008  Computer Networks   2100
8   B1004         ネットワーク構築入門   2200
9   B1009       SQL Handbook   2600

In [157]:
q = '''SELECT title, price, stock FROM books
        ORDER BY price DESC;'''

with engine.connect() as conn:
    df = pd.read_sql_query(text(q), conn)
df

               title  price  stock
0       SQL Handbook   2600   43.0
1         ネットワーク構築入門   2200   56.0
2  Computer Networks   2100   25.0
3          はじめてのDB設計   2000   88.0
4      たのしく学ぶSQLコマンド   1800  120.0
5    みきむら先生の基本情報技術教本   1800   32.0
6       成功する人の108の習慣   1500    2.0
7         風景画を描いてみよう   1500    NaN
8       ウォーキングをはじめよう    980   15.0
9            おてがるレシピ    880   66.0

# 2-12. 単一行演算

In [158]:
q = '''SELECT title, price * stock FROM books;'''
with engine.connect() as conn:
    df = pd.read_sql_query(text(q), conn)
df

               title  price * stock
0      たのしく学ぶSQLコマンド       216000.0
1          はじめてのDB設計       176000.0
2       ウォーキングをはじめよう        14700.0
3         ネットワーク構築入門       123200.0
4       成功する人の108の習慣         3000.0
5            おてがるレシピ        58080.0
6    みきむら先生の基本情報技術教本        57600.0
7  Computer Networks        52500.0
8       SQL Handbook       111800.0
9         風景画を描いてみよう            NaN

In [161]:
q = '''SELECT UPPER(title), LOWER(title), SYSDATE() FROM books'''
with engine.connect() as conn:
    df = pd.read_sql_query(text(q), conn)
df

        UPPER(title)       LOWER(title)           SYSDATE()
0      たのしく学ぶSQLコマンド      たのしく学ぶsqlコマンド 2024-08-17 09:49:04
1          はじめてのDB設計          はじめてのdb設計 2024-08-17 09:49:04
2       ウォーキングをはじめよう       ウォーキングをはじめよう 2024-08-17 09:49:04
3         ネットワーク構築入門         ネットワーク構築入門 2024-08-17 09:49:04
4       成功する人の108の習慣       成功する人の108の習慣 2024-08-17 09:49:04
5            おてがるレシピ            おてがるレシピ 2024-08-17 09:49:04
6    みきむら先生の基本情報技術教本    みきむら先生の基本情報技術教本 2024-08-17 09:49:04
7  COMPUTER NETWORKS  computer networks 2024-08-17 09:49:04
8       SQL HANDBOOK       sql handbook 2024-08-17 09:49:04
9         風景画を描いてみよう         風景画を描いてみよう 2024-08-17 09:49:04

In [162]:
# この記述だとstockカラムがNoneだとNoneが入ってくる
q = '''SELECT title, price*stock FROM books
        WHERE book_id >= 'B1005';
        '''
with engine.connect() as conn:
    df = pd.read_sql_query(text(q), conn)
df

               title  price*stock
0       成功する人の108の習慣       3000.0
1            おてがるレシピ      58080.0
2    みきむら先生の基本情報技術教本      57600.0
3  Computer Networks      52500.0
4       SQL Handbook     111800.0
5         風景画を描いてみよう          NaN

In [163]:
# 単一行関数COALESCEを使用してNoneを0に置き換える。
q = '''SELECT title, price*COALESCE(stock,0) FROM books
        WHERE book_id >= 'B1005';
        '''
with engine.connect() as conn:
    df = pd.read_sql_query(text(q), conn)
df

               title  price*COALESCE(stock,0)
0       成功する人の108の習慣                     3000
1            おてがるレシピ                    58080
2    みきむら先生の基本情報技術教本                    57600
3  Computer Networks                    52500
4       SQL Handbook                   111800
5         風景画を描いてみよう                        0

# 2-13. グループ関数

In [164]:
# メモ。CSVの取り込み簡単すぎない？
# import pandas as pd
# df = pd.read_csv('books.csv')
# df.to_sql('books', con=engine, if_exists='append', index=False)

In [165]:
query = text("""
SELECT 
    date,
    COUNT(*) as usage_count,
    SUM(price) as total_price
FROM 
    books
WHERE 
    date IS NOT NULL
GROUP BY 
    date
""")

with engine.connect() as connection:
    result = connection.execute(query)
    usage_df = pd.DataFrame(result.fetchall(), columns=result.keys())

print(usage_df)

         date  usage_count total_price
0  2001-05-03            1        1800
1  2001-10-21            1        2000
2  2002-09-05            1         980
3  2004-08-04            1        2200
4  2008-03-03            1        1500
5  2012-04-11            1         880
6  2016-08-24            1        1800
7  2018-05-05            1        2100
8  2021-12-01            1        2600

In [167]:
import pandas as pd

# 前のステップで作成したusage_dfを使用する
print("元のデータフレーム:")
print(usage_df)

print("\nD. df[df['usage_count']==df['usage_count'].max()]")
print(usage_df[usage_df['usage_count']==usage_df['usage_count'].max()])

print("\n正解:")
print("D. df[df['usage_count']==df['usage_count'].max()]")

元のデータフレーム:
         date  usage_count total_price
0  2001-05-03            1        1800
1  2001-10-21            1        2000
2  2002-09-05            1         980
3  2004-08-04            1        2200
4  2008-03-03            1        1500
5  2012-04-11            1         880
6  2016-08-24            1        1800
7  2018-05-05            1        2100
8  2021-12-01            1        2600

D. df[df['usage_count']==df['usage_count'].max()]
         date  usage_count total_price
0  2001-05-03            1        1800
1  2001-10-21            1        2000
2  2002-09-05            1         980
3  2004-08-04            1        2200
4  2008-03-03            1        1500
5  2012-04-11            1         880
6  2016-08-24            1        1800
7  2018-05-05            1        2100
8  2021-12-01            1        2600

正解:
D. df[df['usage_count']==df['usage_count'].max()]

In [168]:
from sqlalchemy import create_engine, text
import time


def shared_lock_transaction():
    with engine.connect() as conn:
        conn.execute(text("START TRANSACTION"))
        try:
            # 特定の本（例：B1001）に対して共有ロックを獲得
            result = conn.execute(text("SELECT * FROM books WHERE book_id = 'B1001' FOR SHARE"))
            print("共有ロック： B1001の本にSHAREロックをかけました")
            time.sleep(10)  # 10秒間ロックを保持
            conn.execute(text("COMMIT"))
            print("共有ロック： トランザクションをコミットしました")
        except Exception as e:
            conn.execute(text("ROLLBACK"))
            print(f"共有ロック： エラーが発生しました: {e}")

def exclusive_lock_transaction():
    with engine.connect() as conn:
        conn.execute(text("START TRANSACTION"))
        try:
            # テーブル全体に対して排他ロックを獲得しようとする
            conn.execute(text("LOCK TABLES books WRITE"))
            print("排他ロック： booksテーブル全体にWRITEロックをかけました")
            time.sleep(5)  # 5秒間ロックを保持
            conn.execute(text("UNLOCK TABLES"))
            conn.execute(text("COMMIT"))
            print("排他ロック： トランザクションをコミットしました")
        except Exception as e:
            conn.execute(text("ROLLBACK"))
            print(f"排他ロック： エラーが発生しました: {e}")

def update_book_stock(book_id, new_stock):
    with engine.connect() as conn:
        conn.execute(text("START TRANSACTION"))
        try:
            # 特定の本の在庫を更新（排他ロックが必要）
            conn.execute(text(f"UPDATE books SET stock = :new_stock WHERE book_id = :book_id"),
                         {"new_stock": new_stock, "book_id": book_id})
            print(f"更新操作： {book_id}の在庫を{new_stock}に更新しました")
            conn.execute(text("COMMIT"))
        except Exception as e:
            conn.execute(text("ROLLBACK"))
            print(f"更新操作： エラーが発生しました: {e}")

# 実行例
import threading

# 共有ロックをかける
thread1 = threading.Thread(target=shared_lock_transaction)
thread1.start()

# 少し待ってから排他ロックを試みる
time.sleep(2)
thread2 = threading.Thread(target=exclusive_lock_transaction)
thread2.start()

# 更新操作を試みる
time.sleep(2)
thread3 = threading.Thread(target=update_book_stock, args=('B1001', 100))
thread3.start()

# すべてのスレッドが終了するのを待つ
thread1.join()
thread2.join()
thread3.join()

print("すべての操作が完了しました")

共有ロック： B1001の本にSHAREロックをかけました
共有ロック： トランザクションをコミットしました
排他ロック： booksテーブル全体にWRITEロックをかけました
排他ロック： トランザクションをコミットしました
更新操作： B1001の在庫を100に更新しました
すべての操作が完了しました

In [170]:
with engine.connect() as conn:
    df = pd.read_sql_query(text('SELECT * FROM books'), conn)
df

  book_id              title cat_id        author        date  price  stock
0   B1001      たのしく学ぶSQLコマンド    C01          鈴木正男  2001-05-03   1800  100.0
1   B1002          はじめてのDB設計    C01          鈴木正子  2001-10-21   2000   88.0
2   B1003       ウォーキングをはじめよう    C05          高橋孝子  2002-09-05    980   15.0
3   B1004         ネットワーク構築入門    C01          山田和夫  2004-08-04   2200   56.0
4   B1005       成功する人の108の習慣    C02          高橋太郎  2008-03-03   1500    2.0
5   B1006            おてがるレシピ    C05          佐藤茂夫  2012-04-11    880   66.0
6   B1007    みきむら先生の基本情報技術教本    C03          三木村健  2016-08-24   1800   32.0
7   B1008  Computer Networks    C01  Robert Smith  2018-05-05   2100   25.0
8   B1009       SQL Handbook    C01      John Doe  2021-12-01   2600   43.0
9   B1010         風景画を描いてみよう   None          田中十郎        None   1500    NaN

In [171]:
update_book_stock('B1001', 120)

更新操作： B1001の在庫を120に更新しました

In [174]:
def show_books_df():
    with engine.connect() as conn:
        df = pd.read_sql_query(text('SELECT * FROM books'), conn)
        print(df)
show_books_df()

  book_id              title cat_id        author        date  price  stock
0   B1001      たのしく学ぶSQLコマンド    C01          鈴木正男  2001-05-03   1800  120.0
1   B1002          はじめてのDB設計    C01          鈴木正子  2001-10-21   2000   88.0
2   B1003       ウォーキングをはじめよう    C05          高橋孝子  2002-09-05    980   15.0
3   B1004         ネットワーク構築入門    C01          山田和夫  2004-08-04   2200   56.0
4   B1005       成功する人の108の習慣    C02          高橋太郎  2008-03-03   1500    2.0
5   B1006            おてがるレシピ    C05          佐藤茂夫  2012-04-11    880   66.0
6   B1007    みきむら先生の基本情報技術教本    C03          三木村健  2016-08-24   1800   32.0
7   B1008  Computer Networks    C01  Robert Smith  2018-05-05   2100   25.0
8   B1009       SQL Handbook    C01      John Doe  2021-12-01   2600   43.0
9   B1010         風景画を描いてみよう   None          田中十郎        None   1500    NaN

In [175]:
def shared_lock_transaction(book_id):
    with engine.connect() as conn:
        conn.execute(text("START TRANSACTION"))
        try:
            # 共有ロックを獲得
            result = conn.execute(text(
                "SELECT * FROM books WHERE book_id = :book_id FOR SHARE"),
                {"book_id": book_id}
            ).fetchone()
            print(f"共有ロック：本 {book_id} にSHAREロックをかけました")
            time.sleep(5)  # 5秒間ロックを保持
            conn.execute(text("COMMIT"))
            print(f"共有ロック：本 {book_id} のロックを解除しました")
        except Exception as e:
            conn.execute(text("ROLLBACK"))
            print(f"共有ロック：エラーが発生しました: {e}")

def exclusive_lock_transaction(book_id):
    with engine.connect() as conn:
        conn.execute(text("START TRANSACTION"))
        try:
            # 排他ロックを獲得しようとする（タイムアウトを3秒に設定）
            conn.execute(text("SET innodb_lock_wait_timeout = 3"))
            conn.execute(text(
                "SELECT * FROM books WHERE book_id = :book_id FOR UPDATE"),
                {"book_id": book_id}
            )
            print(f"排他ロック：本 {book_id} にUPDATEロックをかけました")
            conn.execute(text("COMMIT"))
        except Exception as e:
            conn.execute(text("ROLLBACK"))
            print(f"排他ロック：ロックの取得に失敗しました。ロールバックします: {e}")

# テスト実行
book_id = 'B1001'

# 共有ロックをかける
thread1 = threading.Thread(target=shared_lock_transaction, args=(book_id,))
thread1.start()

# 1秒待ってから排他ロックを試みる
time.sleep(1)
thread2 = threading.Thread(target=exclusive_lock_transaction, args=(book_id,))
thread2.start()

# スレッドの終了を待つ
thread1.join()
thread2.join()

print("すべての操作が完了しました")

共有ロック：本 B1001 にSHAREロックをかけました
排他ロック：ロックの取得に失敗しました。ロールバックします: (mysql.connector.errors.DatabaseError) 1205 (HY000): Lock wait timeout exceeded; try restarting transaction
[SQL: SELECT * FROM books WHERE book_id = %(book_id)s FOR UPDATE]
[parameters: {'book_id': 'B1001'}]
(Background on this error at: https://sqlalche.me/e/20/4xp6)
共有ロック：本 B1001 のロックを解除しました
すべての操作が完了しました

In [176]:
!pip install tabulate

Collecting tabulate
  Downloading tabulate-0.9.0-py3-none-any.whl.metadata (34 kB)
Downloading tabulate-0.9.0-py3-none-any.whl (35 kB)
Installing collected packages: tabulate
Successfully installed tabulate-0.9.0

In [177]:
import pandas as pd
import numpy as np
from tabulate import tabulate

# サンプルDataFrameの作成
df = pd.DataFrame({
    'A': np.random.rand(5),
    'B': np.random.randint(0, 100, 5),
    'C': ['foo', 'bar', 'baz', 'qux', 'quux']
})

# 1. to_string()メソッドを使用
print("1. to_string()メソッド:")
print(df.to_string())

# 2. display()関数を使用（Jupyter Notebook環境で有効）
print("\n2. display()関数 (Jupyter Notebook専用):")
print("display(df)  # Jupyter Notebookで実行してください")

# 3. set_optionでの表示オプション設定
print("\n3. set_optionでの表示オプション設定:")
pd.set_option('display.max_rows', None)
pd.set_option('display.max_columns', None)
pd.set_option('display.width', 1000)
pd.set_option('display.colheader_justify', 'center')
pd.set_option('display.precision', 3)
print(df)

# 4. tabulate ライブラリの使用
print("\n4. tabulate ライブラリの使用:")
print(tabulate(df, headers='keys', tablefmt='psql'))

# 5. stylerを使用してHTML形式で表示（Jupyter Notebook環境で有効）
print("\n5. stylerを使用したHTML形式表示 (Jupyter Notebook専用):")
print("df.style.set_properties(**{'text-align': 'center'})  # Jupyter Notebookで実行してください")

# 6. 特定の列のみを表示
print("\n6. 特定の列のみを表示:")
print(df[['A', 'B']])

# オプションをリセット
pd.reset_option('all')

1. to_string()メソッド:
          A   B     C
0  0.553658  34   foo
1  0.861950  98   bar
2  0.415968  49   baz
3  0.495535  38   qux
4  0.741750  17  quux

2. display()関数 (Jupyter Notebook専用):
display(df)  # Jupyter Notebookで実行してください

3. set_optionでの表示オプション設定:
     A     B   C
0  0.554  34   foo
1  0.862  98   bar
2  0.416  49   baz
3  0.496  38   qux
4  0.742  17  quux

4. tabulate ライブラリの使用:
+----+----------+-----+------+
|    |        A |   B | C    |
|----+----------+-----+------|
|  0 | 0.553658 |  34 | foo  |
|  1 | 0.86195  |  98 | bar  |
|  2 | 0.415968 |  49 | baz  |
|  3 | 0.495535 |  38 | qux  |
|  4 | 0.74175  |  17 | quux |
+----+----------+-----+------+

5. stylerを使用したHTML形式表示 (Jupyter Notebook専用):
df.style.set_properties(**{'text-align': 'center'})  # Jupyter Notebookで実行してください

6. 特定の列のみを表示:
     A     B
0  0.554  34
1  0.862  98
2  0.416  49
3  0.496  38
4  0.742  17

/var/folders/vp/nnsffs990cb9grbk5s17z9nw0000gn/T/ipykernel_82886/4165300302.py:42: FutureWarning: data_manager option is deprecated and will be removed in a future version. Only the BlockManager will be available.
  pd.reset_option('all')
/var/folders/vp/nnsffs990cb9grbk5s17z9nw0000gn/T/ipykernel_82886/4165300302.py:42: FutureWarning: use_inf_as_na option is deprecated and will be removed in a future version. Convert inf values to NaN before operating instead.
  pd.reset_option('all')

In [184]:
q = '''SELECT MAX(price) as MAX_price, MIN(price), AVG(price) FROM books'''
with engine.connect() as conn:
    df = pd.read_sql_query(text(q), conn)
    print(tabulate(df, headers='keys', showindex='never'))

  MAX_price    MIN(price)    AVG(price)
-----------  ------------  ------------
       2600           880          1736

In [186]:
# TRUNCATEは切り捨て
q = 'SELECT MAX(price), MIN(price), TRUNCATE(AVG(price), 0) FROM books'
with engine.connect() as conn:
    df = pd.read_sql_query(text(q), conn)
    print(tabulate(df, headers='keys', showindex=False))

  MAX(price)    MIN(price)    TRUNCATE(AVG(price), 0)
------------  ------------  -------------------------
        2600           880                       1736

In [187]:
q = 'SELECT COUNT(*) FROM books;'
with engine.connect() as conn:
    df = pd.read_sql_query(text(q), conn)
df

   COUNT(*)
0        10

In [193]:
q = 'SELECT * FROM books;'
with engine.connect() as conn:
    df = pd.read_sql_query(text(q), conn)
    print(tabulate(df, headers='keys', tablefmt='simple', showindex=False))

book_id    title                           cat_id    author        date          price    stock
---------  ------------------------------  --------  ------------  ----------  -------  -------
B1001      たのしく学ぶSQLコマンド         C01       鈴木正男      2001-05-03     1800      120
B1002      はじめてのDB設計                C01       鈴木正子      2001-10-21     2000       88
B1003      ウォーキングをはじめよう        C05       高橋孝子      2002-09-05      980       15
B1004      ネットワーク構築入門            C01       山田和夫      2004-08-04     2200       56
B1005      成功する人の108の習慣           C02       高橋太郎      2008-03-03     1500        2
B1006      おてがるレシピ                  C05       佐藤茂夫      2012-04-11      880       66
B1007      みきむら先生の基本情報技術教本  C03       三木村健      2016-08-24     1800       32
B1008      Computer Networks               C01       Robert Smith  2018-05-05     2100       25
B1009      SQL Handbook                    C01       John Doe      2021-12-01     2600       43
B1010      風景画を描いてみよう                      田中十郎                     1500      nan

In [198]:
df = get_table_data('books', engine)
df

  book_id              title cat_id        author        date  price  stock
0   B1001      たのしく学ぶSQLコマンド    C01          鈴木正男  2001-05-03   1800  120.0
1   B1002          はじめてのDB設計    C01          鈴木正子  2001-10-21   2000   88.0
2   B1003       ウォーキングをはじめよう    C05          高橋孝子  2002-09-05    980   15.0
3   B1004         ネットワーク構築入門    C01          山田和夫  2004-08-04   2200   56.0
4   B1005       成功する人の108の習慣    C02          高橋太郎  2008-03-03   1500    2.0
5   B1006            おてがるレシピ    C05          佐藤茂夫  2012-04-11    880   66.0
6   B1007    みきむら先生の基本情報技術教本    C03          三木村健  2016-08-24   1800   32.0
7   B1008  Computer Networks    C01  Robert Smith  2018-05-05   2100   25.0
8   B1009       SQL Handbook    C01      John Doe  2021-12-01   2600   43.0
9   B1010         風景画を描いてみよう   None          田中十郎        None   1500    NaN

In [199]:
q = 'SELECT COUNT(cat_id) FROM books'
with engine.connect() as conn:
    df = pd.read_sql_query(text(q), conn)
    print(tabulate(df, headers='keys'))

      COUNT(cat_id)
--  ---------------
 0                9

# 重複行の削除

In [200]:
df = get_table_data('books', engine)
df

  book_id              title cat_id        author        date  price  stock
0   B1001      たのしく学ぶSQLコマンド    C01          鈴木正男  2001-05-03   1800  120.0
1   B1002          はじめてのDB設計    C01          鈴木正子  2001-10-21   2000   88.0
2   B1003       ウォーキングをはじめよう    C05          高橋孝子  2002-09-05    980   15.0
3   B1004         ネットワーク構築入門    C01          山田和夫  2004-08-04   2200   56.0
4   B1005       成功する人の108の習慣    C02          高橋太郎  2008-03-03   1500    2.0
5   B1006            おてがるレシピ    C05          佐藤茂夫  2012-04-11    880   66.0
6   B1007    みきむら先生の基本情報技術教本    C03          三木村健  2016-08-24   1800   32.0
7   B1008  Computer Networks    C01  Robert Smith  2018-05-05   2100   25.0
8   B1009       SQL Handbook    C01      John Doe  2021-12-01   2600   43.0
9   B1010         風景画を描いてみよう   None          田中十郎        None   1500    NaN